{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for all frontend files describing their roles in the app.",
  "frontend/index.css": "Tailwind base styles and custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the root element and loading the main React script.",
  "frontend/src/App.tsx": "App root that renders the GameScreen component.",
  "frontend/src/components/game/Hotbar.tsx": "UI hotbar showing dirt/stone inventory with selectable slots and touch-aware sizing.",
  "frontend/src/components/game/Hud.tsx": "In‑game HUD displaying movement, camera, mining, placing, and collection instructions.",
  "frontend/src/components/game/Tile.tsx": "Renders an individual tile with fog‑of‑war, mining cracks, progress bar, and click handling.",
  "frontend/src/components/game/TouchControls.tsx": "Touch UI providing left/right movement buttons and a jump button for mobile players.",
  "frontend/src/components/game/WorldGrid.tsx": "Manages world state, player physics, camera, input (keyboard/touch), mining, and block placement; renders all tiles.",
  "frontend/src/game/camera.ts": "Computes camera scroll to center the player while clamping within world bounds.",
  "frontend/src/game/constants.ts": "Defines world size, tile size, terrain transition row, and movement physics constants.",
  "frontend/src/game/inventory.ts": "Implements simple dirt/stone inventory with helpers to increment and decrement counts.",
  "frontend/src/game/mining.ts": "Provides mining logic including visibility checks, hit reduction, block breaking, and placement rules.",
  "frontend/src/game/miningConfig.ts": "Stores mining difficulty per block type and exposes a hit‑requirement lookup.",
  "frontend/src/game/types.ts": "Defines core types for block types, tile state, positions, and the world grid.",
  "frontend/src/game/world.ts": "Generates the world grid with dirt/stone layers and a 3×3 starter air pocket.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing ICP Internet Identity authentication.",
  "frontend/src/hooks/useIsTouchDevice.ts": "Detects whether the user's device supports touch input.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook for future backend queries.",
  "frontend/src/index.css": "Tailwind base styles with custom light/dark mining‑themed color variables.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and Internet Identity provider.",
  "frontend/src/screens/GameScreen.tsx": "Renders main game UI, managing inventory, block selection, and mining/placement callbacks.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugin setup.",
  "project_state.json": "Describes the game's current MVP design, including mining/placing rules, hotbar behavior, movement controls, and known issues. Also lists implemented features, architectural notes, and the project state version."
}