{
  "kind": "build_request",
  "title": "Update movement controls: Left/Right walk (hold), Up jump; remove Down input",
  "projectName": "Shadow Mine",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Update keyboard movement so the player moves left while ArrowLeft is held and moves right while ArrowRight is held; releasing the key stops movement; pressing the opposite direction reverses movement immediately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "So there's going to be a left arrow key that moves everything that moves the person left. There will be a right arrow key that moves everyone right."
        ]
      },
      "acceptanceCriteria": [
        "Holding ArrowLeft continuously moves the player left across air tiles until released, blocked by a solid tile, or at the world boundary.",
        "Holding ArrowRight continuously moves the player right across air tiles until released, blocked by a solid tile, or at the world boundary.",
        "Releasing ArrowLeft/ArrowRight stops horizontal movement.",
        "If ArrowLeft is held and ArrowRight is pressed (or vice versa), the player changes direction immediately.",
        "Horizontal movement continues to respect existing collision rules (player cannot move into non-air tiles) and existing camera follow behavior."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Update keyboard controls so ArrowUp triggers jump only (no vertical step movement) and remove any ArrowDown/S key behavior so Down no longer causes any player movement.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Then the upper arrow key... will move or make him jump."
        ]
      },
      "acceptanceCriteria": [
        "Pressing ArrowUp triggers the existing jump behavior only when grounded, consistent with current jump/gravity rules.",
        "Pressing ArrowDown does not move the player in any way.",
        "Pressing S does not move the player in any way (if S was previously mapped to Down)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Update touch controls UI to remove the Down button/control and ensure touch movement only provides Left, Right, and Jump inputs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "make sure to get rid of the down arrow key because there's nothing to use it for"
        ]
      },
      "acceptanceCriteria": [
        "On touch devices, the on-screen control cluster no longer renders a Down arrow button.",
        "There is no Down movement action wired from touch controls into the game.",
        "Left, Right, and Jump touch controls still function."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Update the in-game HUD movement instructions (English) to describe the new control scheme: Left/Right move, Up jumps, and there is no Down control.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "So there's going to be a left arrow key... There will be a right arrow key... Then the upper arrow key... make him jump."
        ]
      },
      "acceptanceCriteria": [
        "HUD movement text no longer mentions Down movement.",
        "HUD movement text clearly states: Left/Right move, Up is Jump, and touch controls (if mentioned) do not include Down."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them only).",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend remains single-actor Motoko; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Add new gameplay systems (shop/door, crafting, new blocks/resources).",
    "Multiplayer support.",
    "Backend persistence, accounts, or syncing player state to the canister.",
    "Changing mining, fog-of-war, inventory, hotbar behavior, or camera behavior beyond what is required to support the movement input changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}