{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Shadow Mine: Hold-to-walk Left/Right, Up-to-jump only, remove Down controls",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Change keyboard horizontal movement to continuous hold-to-walk with immediate direction reversal and stop-on-release while preserving collision and camera behavior.",
      "acceptanceCriteria": [
        "Holding ArrowLeft continuously moves the player left across air tiles until released, blocked by a solid tile, or at the world boundary.",
        "Holding ArrowRight continuously moves the player right across air tiles until released, blocked by a solid tile, or at the world boundary.",
        "Releasing ArrowLeft/ArrowRight stops horizontal movement.",
        "If ArrowLeft is held and ArrowRight is pressed (or vice versa), the player changes direction immediately.",
        "Horizontal movement continues to respect existing collision rules (player cannot move into non-air tiles) and existing camera follow behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/game/WorldGrid.tsx",
          "operation": "modify",
          "description": "Replace the current one-step-per-keypress left/right handling with a held-key state (keydown/keyup) and a timed horizontal movement tick so ArrowLeft/ArrowRight walk continuously while held, stop on release, and reverse immediately when the opposite direction is pressed; keep existing collision checks (canMoveTo/world bounds) and do not alter camera-follow calculations."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Update keyboard controls so Up triggers jump only and remove any Down/S movement behavior.",
      "acceptanceCriteria": [
        "Pressing ArrowUp triggers the existing jump behavior only when grounded, consistent with current jump/gravity rules.",
        "Pressing ArrowDown does not move the player in any way.",
        "Pressing S does not move the player in any way (if S was previously mapped to Down)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/game/WorldGrid.tsx",
          "operation": "modify",
          "description": "Update keyboard input handling so ArrowUp triggers only the existing jump behavior (no vertical step movement), and remove ArrowDown/S mappings that currently move the player down; ensure gravity/jump rules remain unchanged and that ArrowDown/S has no effect."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Remove the Down touch control and ensure touch inputs include only Left, Right, and Jump with no Down action wired into gameplay.",
      "acceptanceCriteria": [
        "On touch devices, the on-screen control cluster no longer renders a Down arrow button.",
        "There is no Down movement action wired from touch controls into the game.",
        "Left, Right, and Jump touch controls still function."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/game/TouchControls.tsx",
          "operation": "modify",
          "description": "Remove the Down button from the touch control cluster, drop the onMoveDown prop, and ensure the component only exposes Left/Right/Jump actions; TouchControls uses the shadcn-ui Button component—verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/game/WorldGrid.tsx",
          "operation": "modify",
          "description": "Update TouchControls wiring to match the new TouchControls props by removing any Down callback and ensuring only Left, Right, and Jump touch actions are passed through to movement/jump logic."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Update HUD movement instructions to reflect the new control scheme: Left/Right move, Up jumps, no Down control (including touch instructions).",
      "acceptanceCriteria": [
        "HUD movement text no longer mentions Down movement.",
        "HUD movement text clearly states: Left/Right move, Up is Jump, and touch controls (if mentioned) do not include Down."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/game/Hud.tsx",
          "operation": "modify",
          "description": "Edit the Movement instruction text to remove any mention of Down movement and clearly describe the updated controls (Left/Right move, Up is Jump, no Down); Hud uses shadcn-ui Card/Badge components—verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}